Repository: s3915185/BrainableApp
Catalog: BrainableApp/*.lproj/Localizable.strings
Languages: vi

source: Swipe Left
vi: Lướt qua trái

source: Clear Data
vi: Xoá thông tin

source: Has account?
vi: Có tài khoản?

source: Log in
vi: Đăng nhập

source: Username:
vi: Tên dùng:

source: Password:
vi: Mật khẩu:

source: Create new account
vi: Tạo tài khoản mới

source: Create
vi: Tạo

source: Leaderboard
vi: Bảng xếp hạng

source: How To Play
vi: Cách chơi

source: Account Information
vi: Thông tin người dùng

source: App Settings
vi: Cài đặt

source: Dark Mode
vi: Chế độ tối

source: Level
vi: Cấp độ

source: Language
vi: Ngôn ngữ

source: Log Out
vi: Đăng xuất

source: Time:
vi: Thời gian:

source: min
vi: ph

source: s
vi: giây

source: minutes
vi: phút

source: seconds
vi: giây

source: Winrates:
vi: Tỉ lệ thắng:

source: Game Total:
vi: Tổng game:

source: Max Win Streak:
vi: Thắng liên tiếp:

source: Achievements
vi: Danh hiệu

source: Exit
vi: Thoát

source: Instructions
vi: Hướng dẫn

# instruction-0
source: To begin with all cells are unknown. I will mark a known black cell with a black square (no surprises there!) and any known white cells with a dot.
vi: Để bắt đầu với tất cả các hộp đều chưa được biết. Mình sẽ đánh dấu ô màu đen đã biết bằng một hình vuông màu đen và bất kỳ ô màu trắng nào đã biết bằng dấu chấm.

# instruction-1
source: 1. First find any solid lines. The 0 means there are no black cells in that row, so we mark every cell in the row with a dot (they are known white cells).
vi: 1. Đầu tiên hãy tìm bất kỳ đường liền nét nào. Số 0 có nghĩa là không có ô đen nào trong hàng đó, vì vậy chúng tôi đánh dấu mọi ô trong hàng bằng một dấu chấm (chúng được gọi là ô trắng).

# instruction-2
source: 2. The 5 means that every cell in the row is black, so we color them all in.
vi: 2. Số 5 có nghĩa là mọi ô trong hàng đều có màu đen, vì vậy chúng ta tô màu tất cả các ô đó.

# instruction-3
source: 3. The 2 / 2 row will be a complete row. There is only one possible way of filling it in â€“ a block of 2 black followed by one white and then another block of two black.
vi: 3. Hàng 2/2 sẽ là một hàng hoàn chỉnh. Chỉ có một cách khả thi để điền vào – một khối có 2 màu đen, tiếp theo là một khối màu trắng và sau đó là một khối khác có hai màu đen.

# instruction-4
source: 4. First column has completed its block of two black. That means every other cell in this column must be white. So we can fill in the remaining cells with a dot.
vi: 4. Cột đầu tiên đã hoàn thành khối hai màu đen. Điều đó có nghĩa là mọi ô khác trong cột này phải có màu trắng. Như vậy chúng ta có thể điền vào các ô còn lại bằng dấu chấm.

# instruction-5
source: 5. Then I start from the bottom to see the bottom-most these blocks can go.
vi: 5. Sau đó, tôi bắt đầu từ phía dưới để xem những khối này có thể đi đến mức thấp nhất.

# instruction-6
source: 6. Where the same blocks overlap, we know that must be a black cell, so we color those overlaps black.
vi: 6. Nơi các khối giống nhau chồng lên nhau, chúng ta biết rằng đó phải là một ô màu đen, vì vậy chúng ta tô màu đen cho các phần chồng lên nhau.

# instruction-7
source: 7. Then we can continue with the overlap tactic over again...
vi: 7. Sau đó chúng ta có thể tiếp tục chiến thuật chồng chéo lần nữa...

source: Game Over
vi: Bạn đã thua

source: Play Again?
vi: Chơi lại?

# game-won
source: You've won the game!
vi: Bạn đã thắng!

source: No record found
vi: Không có danh sách tồn tại

source: Less than 10 seconds
vi: Ít hơn 10 giây

source: Less than 15 seconds
vi: Ít hơn 15 giây

source: Less than 20 seconds
vi: Ít hơn 20 giây

source: Less than 30 seconds
vi: Ít hơn 30 giây

source: Less than 40 seconds
vi: Ít hơn 40 giây

source: Less than 50 seconds
vi: Ít hơn 50 giây

source: Less than 1 minute
vi: Ít hơn 1 phút

source: Less than 1 minute 30 seconds
vi: Ít hơn 1 phút 30 giây

source: Less than 2 minutes
vi: Ít hơn 2 phút

source: Less than 3 minutes
vi: Ít hơn 3 phút

source: Less than 4 minutes
vi: Ít hơn 4 phút

source: Less than 5 minutes
vi: Ít hơn 5 phút

source: Less than 15 minutes
vi: Ít hơn 15 phút

source: Less than 20 minutes
vi: Ít hơn 20 phút

source: Less than 25 minutes
vi: Ít hơn 25 phút

source: Less than 30 minutes
vi: Ít hơn 30 phút

source: Less than 35 minutes
vi: Ít hơn 35 phút

source: Less than 40 minutes
vi: Ít hơn 40 phút

source: Easy
vi: Dễ

source: Intermediate
vi: Vừa

source: Hard
vi: Khó

source: Register
vi: Đăng ký
